[
  {
    "content": "The Pied Piper of Hamelin (花衣魔笛手)",
    "source": "德国传说：小镇鼠患，笛手用笛声引走老鼠，但镇长失信拒付报酬，笛手又用笛声引走所有孩子。道理：做人要守信，违背承诺会付出巨大代价。"
  },
  {
    "content": "望梅止渴",
    "source": "南朝宋·刘义庆《世说新语·假谲》：曹操率军行军，途中缺水，士兵口渴。操曰：“前有大梅林，饶子，甘酸可以解渴。”士卒闻之，口皆出水，乘此得及前源。比喻用空想安慰自己。"
  },
  {
    "content": "The Travellers and the Bear (旅人和熊)",
    "source": "《伊索寓言》：两旅人遇熊，一人爬树，一人装死，熊不碰死人，逃过一劫。树上人问熊说什么，答：“别和遇危险丢下朋友的人同行。”比喻患难见真情。"
  },
  {
    "content": "Cry over spilt milk (为打翻的牛奶哭泣)",
    "source": "西方谚语，最早出现于17世纪。比喻为无法挽回的失误而懊悔无用。"
  },
  {
    "content": "囫囵吞枣",
    "source": "宋·圆悟禅师《碧岩录》：有客曰：“吃梨嚼而不咽可益脾，吃枣咽而不嚼可益齿。”一呆子闻之，曰：“我吃梨只嚼不咽，吃枣只咽不嚼。”人笑曰：“你真是囫囵吞却一个枣也。”比喻对事物不加分析思考，笼统地接受。"
  },
  {
    "content": "The Lion, the Bear, and the Fox (狮子、熊和狐狸)",
    "source": "《伊索寓言》：狮子和熊争小鹿，两败俱伤，狐狸趁机叼走鹿。比喻鹬蚌相争，渔翁得利。"
  },
  {
    "content": "江郎才尽",
    "source": "《南史·江淹传》：江淹少时以文章显，晚年才思微退。传说梦一美丈夫，自称郭璞，索还五色笔，淹探怀授之，尔后为诗绝无美句，时人谓之才尽。比喻才思减退。"
  },
  {
    "content": "The Man and the Wood (人和树林)",
    "source": "《伊索寓言》：人求树林给斧柄，树林同意，结果人装上斧柄砍伐树林。比喻帮助敌人反害己。"
  },
  {
    "content": "The Writing on the Wall (墙上的字迹)",
    "source": "《圣经·但以理书》：巴比伦王伯沙撒宴饮时，有手指在墙上写神秘字迹。先知但以理解释这是亡国的预言，当夜伯沙撒被杀。比喻不祥之兆。"
  },
  {
    "content": "破镜重圆",
    "source": "唐·孟棨《本事诗·情感》：陈朝将亡，驸马徐德言料与妻乐昌公主离散，破一铜镜，各执一半，约他年正月十五卖于市。陈亡，公主没入杨素家。德言依期至京，见老仆卖半镜，出己半镜合之，题诗曰：“镜与人俱去，镜归人不归。无复嫦娥影，空留明月辉。”公主得诗悲泣不食。素知之，遂召德言，还其妻。比喻夫妻离散或决裂后重新团聚。"
  },
  {
    "content": "The Mountain in Labor (分娩的山)",
    "source": "《伊索寓言》：山崩地裂似分娩，结果只生出小老鼠。比喻雷声大雨点小。"
  },
  {
    "content": "鸡鸣狗盗",
    "source": "《史记·孟尝君列传》：秦昭王囚孟尝君欲杀之。孟尝君使人求昭王幸姬求解。幸姬欲得狐白裘，孟尝君一裘已献昭王。客有能为狗盗者，夜入秦宫盗裘献幸姬，姬为言昭王释孟尝君。孟尝君变姓名夜半至函谷关。关法鸡鸣而出客。客有居下坐者能为鸡鸣，遂鸡鸣而出关。比喻微不足道的技能或具有这类技能的人。"
  },
  {
    "content": "Green Eggs and Ham (绿鸡蛋和火腿)",
    "source": "苏斯博士绘本：Sam一直让朋友尝绿鸡蛋和火腿，朋友坚决拒绝，最后尝试后才发现很好吃。道理：不要害怕尝试新事物，你可能会发现意想不到的喜欢。"
  },
  {
    "content": "孺子可教",
    "source": "《史记·留侯世家》：张良游下邳圯上，遇老父堕履圯下，命良取履，并伸足令穿之，良皆从容为之。父曰：“孺子可教矣。后五日平明，与我会此。”后授良《太公兵法》。指年轻人有出息，可以造就。"
  },
  {
    "content": "画龙点睛",
    "source": "唐·张彦远《历代名画记》：张僧繇于金陵安乐寺画四龙，不点睛。每云：“点之即飞去。”人以为妄诞，固请点之。须臾，雷电破壁，二龙乘云上天，未点睛者见在。比喻作文或说话时在关键地方加上精辟的语句，使内容更加生动传神。"
  },
  {
    "content": "The Wolf and the Lamb (狼和小羊)",
    "source": "《伊索寓言》：狼想吃小羊，诬陷小羊弄脏其水（在上游）、去年骂他（小羊未出生）、一定是亲戚骂的，遂吃小羊。比喻欲加之罪，何患无辞。"
  },
  {
    "content": "负荆请罪",
    "source": "《史记·廉颇蔺相如列传》：廉颇不服蔺相如位居己上，扬言羞辱他。蔺相如以国家利益为重，处处避让。廉颇得知后，背负荆条上门请罪，二人成刎颈之交。比喻主动向人认错赔罪。"
  },
  {
    "content": "高山流水",
    "source": "《列子·汤问》：伯牙善鼓琴，钟子期善听。伯牙志在高山，钟子期曰：“善哉，峨峨兮若泰山！”志在流水，钟子期曰：“善哉，洋洋兮若江河！”子期死，伯牙破琴绝弦，终身不复鼓琴。比喻知音难遇或乐曲高妙。"
  },
  {
    "content": "Stone Soup (石头汤)",
    "source": "欧洲民间故事：士兵对村民说能用石头做汤。村民好奇，士兵说加点盐肉汤更香，村民纷纷贡献食材，最后大家共享美餐。道理：分享与合作可以让每个人受益，创造奇迹。"
  },
  {
    "content": "毛遂自荐",
    "source": "《史记·平原君虞卿列传》：秦围邯郸，平原君赴楚求救，选二十门客，缺一人。毛遂自荐同行。平原君曰：“贤士处世，若锥处囊中，其末立见。先生来三年，未有所闻。”遂曰：“臣乃今日请处囊中耳。使遂蚤得处囊中，乃脱颖而出，非特其末见而已。”至楚，毛遂果助平原君与楚定盟。比喻自告奋勇，推荐自己。"
  },
  {
    "content": "囊萤映雪",
    "source": "“囊萤”出自《晋书·车胤传》：车胤家贫不常得油，夏月则练囊盛数十萤火以照书，以夜继日焉。“映雪”出自《孙氏世录》：孙康家贫，常映雪读书。形容在困苦环境中勤奋读书。"
  },
  {
    "content": "Pandora's Box (潘多拉的魔盒)",
    "source": "希腊神话：普罗米修斯盗火给人类后，宙斯命赫菲斯托斯用泥土创造出第一个女人潘多拉作为惩罚。潘多拉带着一个魔盒来到人间，她出于好奇打开了盒子，释放出世间所有灾难，只留下“希望”在盒底。比喻灾祸的根源。"
  },
  {
    "content": "The Ugly Duckling (丑小鸭)",
    "source": "安徒生童话：一只小天鹅被误生在鸭群中，因相貌怪异受尽欺凌。但它保持善良，长大后发现自己原是美丽的天鹅。告诉孩子：是金子总会发光，不要以貌取人，要接纳独特的自己。"
  },
  {
    "content": "磨杵成针",
    "source": "明·陈仁锡《潜确类书》：李白少时读书未成弃去。道逢老妪磨杵，白问其故，曰：“欲作针。”白感其言，遂还卒业。比喻有恒心肯努力，终能成功。"
  },
  {
    "content": "朝三暮四",
    "source": "《庄子·齐物论》：养猴人给猴子分橡实，说：“早上三颗，晚上四颗。”众猴怒。改口：“那么早上四颗，晚上三颗。”众猴皆喜。实质未变，只是变换名目，使其满意。原指愚弄手法，后多指反复无常。"
  },
  {
    "content": "The Fox and the Mask (狐狸和面具)",
    "source": "《伊索寓言》：狐狸进演员家，见精巧面具，说好看没脑子。比喻外表华美无内涵。"
  },
  {
    "content": "乐不思蜀",
    "source": "《三国志·蜀书·后主传》裴松之注引《汉晋春秋》：司马昭问蜀汉亡国之君刘禅：“颇思蜀否？”禅答：“此间乐，不思蜀。”比喻乐而忘返或乐而忘本。"
  },
  {
    "content": "夸父逐日",
    "source": "《山海经·海外北经》：夸父与太阳赛跑，追至日落处，口渴难耐，饮于黄河、渭河，犹不足，欲北饮大泽，未至，道渴而死。弃其杖，化为邓林。比喻决心大或不自量力。"
  },
  {
    "content": "狗尾续貂",
    "source": "《晋书·赵王伦传》：奴卒厮役亦加以爵位。每朝会，貂蝉盈坐，时人为之谚曰：“貂不足，狗尾续。”本指封官太滥，后比喻拿不好的东西接到好的东西后面，显得好坏不相称（多指文学作品）。"
  },
  {
    "content": "The Fox and the Lion (狐狸和狮子)",
    "source": "《伊索寓言》：狐狸初见狮子吓跑，再见不那么怕，第三次敢搭话。比喻熟识能减少恐惧。"
  },
  {
    "content": "The Lion and the Mouse (狮子和老鼠)",
    "source": "《伊索寓言》：狮子放走老鼠，后狮子被网困住，老鼠咬断绳子救之。告诉孩子：不要轻视小人物，强者也需要弱者帮助，与人为善总会有好报。"
  },
  {
    "content": "The Bat and the Weasels (蝙蝠和黄鼠狼)",
    "source": "《伊索寓言》：蝙蝠第一次被黄鼠狼（恨鸟）捉住，说自己是鼠类获释；第二次被另一恨鼠的黄鼠狼捉住，说自己是鸟类获释。比喻随机应变。"
  },
  {
    "content": "The Crab and Its Mother (螃蟹和妈妈)",
    "source": "《伊索寓言》：母蟹批评小蟹横着走，让小蟹直走。小蟹说妈妈先示范。比喻身教胜于言教。"
  },
  {
    "content": "梁上君子",
    "source": "《后汉书·陈寔传》：有盗夜入其室，止于梁上。寔阴见，乃起自整拂，呼命子孙，正色训之曰：“夫人不可不自勉。不善之人未必本恶，习以性成，遂至于此。梁上君子者是矣！”盗大惊，自投于地。后指窃贼。"
  },
  {
    "content": "指鹿为马",
    "source": "《史记·秦始皇本纪》：赵高欲为乱，恐群臣不听，乃先设验，持鹿献于二世，曰：“马也。”二世笑曰：“丞相误邪？谓鹿为马。”问左右，左右或默，或言马以阿顺赵高，或言鹿者。高因阴中诸言鹿者以法。后群臣皆畏高。比喻故意颠倒黑白，混淆是非。"
  },
  {
    "content": "Bite the bullet (咬紧牙关)",
    "source": "据说源于战场手术没有麻醉剂时，让士兵咬住子弹以忍受疼痛。比喻硬着头皮忍受痛苦或艰难。"
  },
  {
    "content": "The Mice and the Weasels (老鼠和黄鼠狼)",
    "source": "《伊索寓言》：老鼠和黄鼠狼打仗，老鼠选将领戴角指挥，结果角卡洞口进不去，被灭。比喻虚荣招灾。"
  },
  {
    "content": "The Hart and the Hunter (雄鹿和猎人)",
    "source": "《伊索寓言》：雄鹿欣赏角美嫌腿细，被猎人追时，角挂树丛，细腿救命。后悔平时抱怨腿。比喻有用之物不显眼。"
  },
  {
    "content": "南柯一梦",
    "source": "唐·李公佐《南柯太守传》：淳于棼醉后梦入大槐安国，被招为驸马，任南柯太守，荣华富贵。后率兵出征战败，被遣归。醒后见槐树下蚁穴，即梦中槐安国。比喻一场空欢喜。"
  },
  {
    "content": "The Man and His Two Wives (男人和两个妻子)",
    "source": "《伊索寓言》：中年男人有老少二妻，少妻拔其白发，老妻拔其黑发，结果变秃头。比喻两方对立，居中者受害。"
  },
  {
    "content": "The Eagle and the Arrow (鹰和箭)",
    "source": "《伊索寓言》：鹰中箭，见箭羽是自己的羽毛，悲叹被自己的羽毛所杀。比喻被自己的东西所害。"
  },
  {
    "content": "The Dot (点)",
    "source": "绘本：小女孩不会画画，老师鼓励她“画个记号看看”。她愤怒地点了个点，被老师装裱起来。这激励她画了更多更好的点。道理：一个小小的鼓励可以激发巨大的潜能，要有开始的勇气。"
  },
  {
    "content": "口若悬河",
    "source": "南朝宋·刘义庆《世说新语·赏誉》：王太尉云：“郭子玄语议如悬河泻水，注而不竭。”形容能言善辩，说话滔滔不绝。"
  },
  {
    "content": "世外桃源",
    "source": "晋·陶渊明《桃花源记》：描述一渔人偶入与世隔绝的桃花源，其中居民避秦时乱，不知有汉，无论魏晋。生活安宁。后指理想中的美好世界。"
  },
  {
    "content": "The Frogs Desiring a King (青蛙求王)",
    "source": "《伊索寓言》：青蛙求神给王，神给木头，青蛙嫌不动，换鹤当王，鹤吃青蛙，后悔莫及。比喻不安于现状反更糟。"
  },
  {
    "content": "赤膊上阵",
    "source": "《三国演义》第五十九回：许褚裸衣斗马超。形容不顾一切地猛打猛冲，也比喻坏人公开跳出来干坏事。"
  },
  {
    "content": "The Dog and the Wolf (狗和狼)",
    "source": "《伊索寓言》：狼羡慕狗吃好住好，见狗颈有勒痕，知失去自由，宁愿挨饿也要自由。比喻自由胜过舒适。"
  },
  {
    "content": "The Giving Tree (爱心树)",
    "source": "谢尔·希尔弗斯坦绘本：树无私地给予男孩苹果、树枝、树干，直到只剩树墩，让男孩（已老）休息。道理：爱是无私的奉献，同时也要学会感恩。"
  },
  {
    "content": "图穷匕见",
    "source": "《战国策·燕策三》：荆轲奉燕督亢地图见秦王，图穷而匕首现。轲持匕首刺秦王不中，被杀。比喻事情发展到最后，真相或本意显露出来。"
  },
  {
    "content": "The Oak and the Woodcutters (橡树和樵夫)",
    "source": "《伊索寓言》：橡树对樵夫说被自己所生斧柄砍倒很悲哀。比喻被自己所助者伤害最痛心。"
  },
  {
    "content": "The Forbidden Fruit (禁果)",
    "source": "《圣经·创世纪》：上帝禁止亚当夏娃吃知善恶树上的果子。夏娃受蛇诱惑，与亚当同食，被逐出伊甸园。比喻因被禁止而更想得到的东西。"
  },
  {
    "content": "The Dog and the Hare (狗和野兔)",
    "source": "《伊索寓言》：猎狗追兔，每次快追上就放弃，猎人责备，狗说为饱餐跑，兔为性命跑。同“The Hare and the Hound”。"
  },
  {
    "content": "The Trojan Horse (特洛伊木马)",
    "source": "希腊神话：希腊联军围攻特洛伊十年不克，造巨大木马，内藏士兵，佯装撤退。特洛伊人将木马当作战利品拖入城中。夜间伏兵出动，里应外合攻陷特洛伊。比喻从内部进行的颠覆活动。"
  },
  {
    "content": "完璧归赵",
    "source": "《史记·廉颇蔺相如列传》：秦王愿以十五城换赵国的和氏璧。蔺相如携璧入秦，见秦王无诚意，机智周旋，最终将完好无损的和氏璧带回赵国。比喻原物完整归还。"
  },
  {
    "content": "一字千金",
    "source": "《史记·吕不韦列传》：吕不韦使门客著《吕氏春秋》，书成，公布于咸阳城门，悬千金于上，延请诸侯游士宾客，有能增损一字者予千金。形容文辞精妙，价值极高。"
  },
  {
    "content": "The Wolf and the Shepherd (狼和牧羊人)",
    "source": "《伊索寓言》：狼跟随羊群不扰，牧羊人初警惕，后放松，狼趁机吃羊。比喻伪装的敌人。"
  },
  {
    "content": "The Dog and Its Reflection (狗和影子)",
    "source": "《伊索寓言》：狗叼肉过桥，见水中影子，以为另一狗叼更大肉，扑咬之，结果自己的肉也掉入水中。比喻贪心不足反而失去已有。"
  },
  {
    "content": "The Polar Express (极地特快)",
    "source": "绘本：小男孩在圣诞夜乘坐魔法火车去北极见圣诞老人，获得第一个圣诞礼物——雪橇上的银铃。只有相信圣诞老人的人才能听到铃声。道理：要保持信念和童心，世界上最真实的东西，有时我们看不见，却需要用心感受。"
  },
  {
    "content": "The Thirsty Pigeon (口渴的鸽子)",
    "source": "《伊索寓言》：鸽子见广告画有水，撞画晕倒被捉。比喻盲目冲动危险。"
  },
  {
    "content": "The Jay and the Peacocks (松鸦和孔雀)",
    "source": "《伊索寓言》：松鸦捡孔雀羽毛装扮自己，混入孔雀群被识破驱赶，回鸦群也不被接纳。比喻盲目模仿失去自我。"
  },
  {
    "content": "The Goose that Laid the Golden Eggs (下金蛋的鹅)",
    "source": "《伊索寓言》：农夫有鹅每日下一金蛋。贪心的农夫以为鹅肚内有金块，杀鹅取之，却什么也没有。道理：不要贪得无厌，否则会失去一切。要珍惜已有的幸福。"
  },
  {
    "content": "鹬蚌相争",
    "source": "《战国策·燕策二》：蚌晒太阳，鹬啄其肉，蚌合壳夹住鹬嘴。双方不相让。渔翁见而并擒之。比喻双方相持不下，使第三者得利。"
  },
  {
    "content": "The Little Boy Who Cried Wolf (喊狼来了的男孩)",
    "source": "《伊索寓言》：牧童屡次谎喊“狼来了”捉弄村民取乐。当狼真来时，他再呼救，村民不信，无人救援，羊群被吃。说明说谎会失去信任， honesty is the best policy（诚实是最好的策略）。"
  },
  {
    "content": "杞人忧天",
    "source": "《列子·天瑞》：杞国有人担心天会塌、地会陷，自己无处安身，以致吃不下睡不着。后经人开导，方才放下心来。比喻不必要的忧虑。"
  },
  {
    "content": "The Tortoise and the Hare (乌龟和兔子)",
    "source": "《伊索寓言》：兔子嘲笑乌龟爬得慢，乌龟提出赛跑。兔子自信奔跑，中途睡觉，乌龟坚持不懈，最终先到达终点。说明“慢而稳，赢比赛”(Slow and steady wins the race)，骄傲使人落后。"
  },
  {
    "content": "The Serpent and the File (蛇和锉刀)",
    "source": "《伊索寓言》：蛇爬进铁匠铺咬锉刀，锉刀说只会从我这儿受挫。比喻攻击强者自取其辱。"
  },
  {
    "content": "买椟还珠",
    "source": "《韩非子·外储说左上》：楚国人到郑国卖珍珠，用名贵木兰做匣子，以桂椒熏香，缀以珠玉、玫瑰、翡翠。郑国人买下匣子，却把珍珠还给了楚人。比喻取舍不当，次要的比主要的更好。"
  },
  {
    "content": "凿壁偷光",
    "source": "《西京杂记》卷二：匡衡勤学而无烛，邻舍有烛而不逮，衡乃穿壁引其光，以书映光而读之。形容勤学苦读。"
  },
  {
    "content": "黔驴技穷",
    "source": "唐·柳宗元《三戒·黔之驴》：黔地无驴，有人带入一头。老虎初见庞然大物，不敢靠近。驴子踢蹄鸣叫，虎以为要吃自己，甚恐。后观察觉其技止此耳，遂扑食之。比喻有限的本领用尽。"
  },
  {
    "content": "The City Mouse and the Country Mouse (城里老鼠和乡下老鼠)",
    "source": "《伊索寓言》：城里老鼠邀乡下老鼠做客，享受奢华食物但时受惊吓。乡下老鼠宁愿回乡过平静贫穷生活。道理：宁愿安逸平淡，不愿担惊受怕的富贵。平凡的生活也可能更快乐。"
  },
  {
    "content": "Pyrrhic victory (皮洛士式胜利)",
    "source": "伊庇鲁斯国王皮洛士在阿斯库路姆战役击败罗马，但己方损失惨重。他说：“再这样胜一次，我们就完了。”比喻代价惨重、得不偿失的胜利。"
  },
  {
    "content": "东山再起",
    "source": "《晋书·谢安传》：谢安辞官隐居会稽东山，朝廷多次征召不出。年逾四十复出，官至宰相，成功指挥淝水之战。指退隐后再度出任要职，也比喻失势后重新恢复地位。"
  },
  {
    "content": "The Farmer and the Stork (农夫和鹳)",
    "source": "《伊索寓言》：鹳和鹤一起吃农夫种的庄稼，被网捉住。鹳求饶说不是鹤类，农夫说既同吃庄稼就同罪。比喻与坏人为伍受牵连。"
  },
  {
    "content": "The Tortoise and the Hare (龟兔赛跑)",
    "source": "《伊索寓言》：兔子嘲笑乌龟爬得慢，乌龟提出赛跑。兔子自信奔跑，中途睡觉，乌龟坚持不懈，最终先到达终点。说明缓慢而持之以恒能胜于急躁。"
  },
  {
    "content": "卧薪尝胆",
    "source": "《史记·越王勾践世家》：越王勾践被吴王夫差打败后，睡柴草、尝苦胆，时刻不忘亡国之耻，励精图治，最终灭吴。比喻刻苦自励，发愤图强。"
  },
  {
    "content": "The Boy and the Filberts (男孩和榛果)",
    "source": "《伊索寓言》：男孩手抓太多榛果卡瓶口，不愿放弃一些，结果一颗也拿不出。比喻贪多必失。"
  },
  {
    "content": "东施效颦",
    "source": "《庄子·天运》：美女西施因心口痛，皱眉捂胸而行。同村丑女东施见之，以为美，也模仿其态，结果富人闭门不出，穷人携家远离。比喻盲目模仿，效果适得其反。"
  },
  {
    "content": "程门立雪",
    "source": "《宋史·杨时传》：杨时、游酢拜见程颐，时值大雪，颐偶瞑坐，二人遂侍立不去。待颐觉，门外雪深一尺。比喻尊师重道，虔诚求教。"
  },
  {
    "content": "夜郎自大",
    "source": "《史记·西南夷列传》：滇王与汉使者言曰：“汉孰与我大？”及夜郎侯亦然。以道不通，故各以为一州主，不知汉广大。比喻妄自尊大。"
  },
  {
    "content": "小时了了",
    "source": "南朝宋·刘义庆《世说新语·言语》：孔融十岁随父到洛阳，访名士李元礼，自称是李家亲戚。元礼问其故，融曰：“先君孔子与君先人李老君同德比义，而相师友，则融与君累世通家。”众奇之。太中大夫陈韪后至，人以其语告之，韪曰：“小时了了，大未必佳。”融曰：“想君小时，必当了了。”韪大踧踖。指人少年时聪明。"
  },
  {
    "content": "The Crow and the Pitcher (乌鸦和水罐)",
    "source": "《伊索寓言》：乌鸦口渴见水罐水少喝不到，叼石子投入罐中使水位上升喝到水。比喻智慧解决问题。"
  },
  {
    "content": "The Peacock and Juno (孔雀和朱诺)",
    "source": "《伊索寓言》：孔雀向朱诺抱怨夜莺歌声美自己却哑。朱诺说你有美丽羽毛应知足。比喻人应知足，不要羡慕别人。"
  },
  {
    "content": "洛阳纸贵",
    "source": "《晋书·左思传》：左思写成《三都赋》，豪贵之家竞相传写，洛阳为之纸贵。比喻著作风行一时。"
  },
  {
    "content": "画蛇添足",
    "source": "《战国策·齐策二》：楚国贵族祭祀后赏酒给门客，酒少人多，约定画蛇最快者饮酒。一人先画完，见他人未完成，为蛇添足，结果被他人嘲笑：“蛇本无足，你怎能乱画？”从而失酒。比喻多此一举，反而坏事。"
  },
  {
    "content": "The North Wind and the Sun (北风与太阳)",
    "source": "《伊索寓言》：北风与太阳比赛让旅人脱衣。北风猛吹，旅人裹紧衣服；太阳温暖照射，旅人自动脱衣。说明温和说服胜于强迫。"
  },
  {
    "content": "The Vine and the Goat (葡萄藤和山羊)",
    "source": "《伊索寓言》：葡萄藤被山羊吃嫩叶，说山羊将被献祭用其角盛酒。比喻恶有恶报。"
  },
  {
    "content": "The Velveteen Rabbit (绒布小兔子)",
    "source": "童话：玩具兔子问“什么是真实？”皮马说：“当孩子真正爱你，你变得破旧，那就成了‘真实’。”道理：真正的价值不在于外表崭新，而在于被爱和经历时光的痕迹。"
  },
  {
    "content": "四面楚歌",
    "source": "《史记·项羽本纪》：项羽军壁垓下，兵少食尽，汉军及诸侯兵围之数重。夜闻汉军四面皆楚歌，项王乃大惊曰：“汉皆已得楚乎？是何楚人之多也！”比喻陷入四面受敌、孤立无援的境地。"
  },
  {
    "content": "愚公移山",
    "source": "《列子·汤问》：北山愚公年近九十，因太行、王屋二山阻碍出行，决心移山。智叟笑他愚蠢。愚公说：“我死后有子，子又有孙，山却不会增高，何愁不平？”天帝感其诚，命神背走二山。比喻持之以恒。"
  },
  {
    "content": "按图索骥",
    "source": "明·杨慎《艺林伐山》：伯乐《相马经》有“隆颡蛈日，蹄如累曲”之语，其子执《马经》以求马。出见大蟾蜍，谓其父曰：“得一马，略与相同，但蹄不如累曲尔。”伯乐知其子之愚，但转怒为笑曰：“此马好跳，不堪御也。”比喻墨守成规办事，也比喻按照线索去寻找。"
  },
  {
    "content": "The Cock and the Fox (公鸡和狐狸)",
    "source": "《伊索寓言》：狐狸骗公鸡说动物和平了，下来拥抱，公鸡说看狗来了，狐狸跑，公鸡说狗来你跑什么。比喻骗局被揭穿。"
  },
  {
    "content": "The Two Pots (两只罐子)",
    "source": "《伊索寓言》：铜罐邀陶罐同行，陶罐怕碰撞拒绝，说宁愿离远点，因为碰碎的是自己。比喻弱者应避免与强者竞争。"
  },
  {
    "content": "All roads lead to Rome (条条大路通罗马)",
    "source": "西方谚语，源于罗马帝国时期发达的交通网。比喻采用不同方法可达相同目标。"
  },
  {
    "content": "The Sneetches (史尼奇)",
    "source": "苏斯博士故事：有的史尼奇肚皮有星，看不起没星的。商人用机器给没星的贴星，又给原来的去星…最后大家分不清谁是谁，明白了有星无星并不重要。道理：不要以貌取人，平等和尊重最重要，外在标签毫无意义。"
  },
  {
    "content": "Meet one's Waterloo (遭遇滑铁卢)",
    "source": "1815年，拿破仑在滑铁卢战役中惨败，结束政治生涯。比喻遭到决定性失败。"
  },
  {
    "content": "The Frog and the Ox (青蛙和牛)",
    "source": "《伊索寓言》：青蛙羡慕牛的庞大，鼓气想和牛一样大，结果肚子爆裂。比喻不自量力。"
  },
  {
    "content": "草木皆兵",
    "source": "《晋书·苻坚载记》：淝水之战前，前秦苻坚登城望见晋军阵容严整，又望八公山上草木，皆类人形，顾谓融曰：“此亦劲敌也，何谓少乎？”形容惊慌时疑神疑鬼。"
  },
  {
    "content": "The Swallow and the Other Birds (燕子和别的鸟)",
    "source": "《伊索寓言》：燕子见农夫播种亚麻（用于做网），劝众鸟吃掉种子，众鸟不听。后亚麻长成做网捕鸟。燕子说早告诉你们。比喻防患于未然。"
  },
  {
    "content": "门可罗雀",
    "source": "《史记·汲郑列传》：始翟公为廷尉，宾客阗门；及废，门外可设雀罗。翟公复为廷尉，宾客欲往，翟公乃大署其门曰：“一死一生，乃知交情。一贫一富，乃知交态。一贵一贱，交情乃见。”形容门庭冷落，宾客稀少。"
  },
  {
    "content": "The Cat and the Birds (猫和鸟)",
    "source": "《伊索寓言》：猫扮医生问鸟病情，鸟说我们很好，你离开我们就更好。比喻识破伪装。"
  },
  {
    "content": "退避三舍",
    "source": "《左传·僖公二十三年、二十八年》：晋公子重耳流亡至楚，楚成王款待他。问重耳如何报答，重耳答若两国交战，晋军将退避三舍（九十里）。后城濮之战，晋文公（重耳）果退九十里以报楚，继而大败楚军。比喻退让和回避。"
  },
  {
    "content": "The Snow Queen (白雪女王)",
    "source": "安徒生童话：魔鬼的魔镜碎片扎进小男孩凯的心里，他变得冷酷，被白雪女王带走。女孩格尔达历经千辛万苦，用爱与眼泪融化他心中的冰。道理：真爱和友情的力量可以战胜一切冷酷和邪恶。"
  },
  {
    "content": "The Thief and His Mother (小偷和妈妈)",
    "source": "《伊索寓言》：小孩偷同学写字板，妈妈夸奖；偷外套，又夸；长大偷贵重物品被判死刑，咬掉妈妈耳朵说若初次偷时打我，就不会至此。比喻小错不纠酿大祸。"
  },
  {
    "content": "项庄舞剑",
    "source": "《史记·项羽本纪》：鸿门宴上，范增命项庄舞剑，欲乘机杀刘邦。项伯亦拔剑起舞，常以身翼蔽刘邦。张良告樊哙曰：“今者项庄拔剑舞，其意常在沛公也。”比喻说话或行动虽然表面上另有名目，其真实意图却在于对某人某事进行威胁或攻击。"
  },
  {
    "content": "The Tale of Peter Rabbit (小兔彼得的故事)",
    "source": "毕翠克丝·波特绘本：兔妈妈告诫别去麦格先生的菜园，彼得调皮跑去，被追得丢衣服生病。道理：要听从长辈的劝告，调皮可能会带来麻烦。"
  },
  {
    "content": "破釜沉舟",
    "source": "《史记·项羽本纪》：项羽率军渡漳河救巨鹿，下令砸破锅、沉没船，只带三日粮，以示决一死战。最终大败秦军。比喻下定决心，不留退路。"
  },
  {
    "content": "The Fox and the Goat (狐狸和山羊)",
    "source": "《伊索寓言》：狐狸掉井里，骗山羊下来喝水，然后踩羊角跳出去，不管山羊。比喻不辨真伪受害。"
  },
  {
    "content": "Cross the Rubicon (渡过卢比孔河)",
    "source": "公元前49年，恺撒违反将领不得率军渡过卢比孔河的法律，进军罗马，引发内战。他说：“骰子已经掷下。”比喻破釜沉舟，义无反顾。"
  },
  {
    "content": "The Horse and the Groom (马和马夫)",
    "source": "《伊索寓言》：马夫偷卖马料钱还替马梳洗，马说若真关心就让我吃饱。比喻虚情假意。"
  },
  {
    "content": "The Three Little Pigs (三只小猪)",
    "source": "英国童话：猪大哥盖草房，猪二哥盖木房，都被狼吹倒；猪小弟勤恳盖砖房，狼无法吹倒，保护了大家。道理：认真努力、有远见和扎实的基础才能抵御困难。"
  },
  {
    "content": "Draconian laws (德拉古法律)",
    "source": "公元前7世纪雅典执政官德拉古制定的法律，以严酷著称，几乎所有罪行都判死刑。比喻严刑峻法。"
  },
  {
    "content": "Where the Wild Things Are (野兽家园)",
    "source": "莫里斯·桑达克绘本：男孩麦克斯胡闹后受罚，幻想来到野兽国成为国王，狂欢后感到孤独，最终回到有晚餐的真实的家。道理：家是最温暖的港湾，要学会管理自己的情绪。"
  },
  {
    "content": "The Sick Stag (生病的雄鹿)",
    "source": "《伊索寓言》：病鹿的“朋友”来探望，吃光周围草，鹿饿死。比喻坏朋友比敌人更危险。"
  },
  {
    "content": "The Rainbow Fish (彩虹鱼)",
    "source": "绘本：彩虹鱼有闪亮鳞片，但很孤独。海星建议它分享鳞片给其他鱼。分享后，它虽没了全部闪鳞，却获得了朋友和快乐。道理：分享比独占更能带来真正的快乐。"
  },
  {
    "content": "Fifth Column (第五纵队)",
    "source": "西班牙内战时期，叛军将领摩拉称其四个纵队正向马德里进军，城内还有“第五纵队”里应外合。比喻内奸或间谍。"
  },
  {
    "content": "乐此不疲",
    "source": "《后汉书·光武帝纪》：帝每日视朝，日昃乃罢。数引公卿、郎、将讲论经理，夜分乃寐。皇太子见帝勤劳不怠，承间谏曰：“……愿顾爱精神，优游自宁。”帝曰：“我自乐此，不为疲也。”形容对某事特别爱好而沉浸其中。"
  },
  {
    "content": "病入膏肓",
    "source": "《左传·成公十年》：晋景公病，请秦国名医缓诊治。医未至，景公梦疾化为二竖子，一曰：“彼良医也，惧伤我，焉逃之？”其一曰：“居肓之上，膏之下，若我何？”医至，曰：“疾不可为也，在肓之上，膏之下，攻之不可，达之不及，药不至焉，不可为也。”景公以为良医。后形容病情严重无法医治，也比喻事态严重无法挽救。"
  },
  {
    "content": "The Hare and the Hound (兔子和猎狗)",
    "source": "《伊索寓言》：猎狗追兔未逮，牧羊人讥笑，猎狗说为饱餐奔跑，兔为性命奔跑。比喻动机不同，努力不同。"
  },
  {
    "content": "The Farmer and the Fox (农夫和狐狸)",
    "source": "《伊索寓言》：狐狸偷鸡，农夫咒骂，狐狸说若他丢鸡粮也会偷。比喻立场不同看法不同。"
  },
  {
    "content": "The Bundle of Sticks (一捆木棍)",
    "source": "《伊索寓言》：父亲给争吵的儿子们一捆棍子，折不断；拆开单根易折。比喻团结就是力量。"
  },
  {
    "content": "萧规曹随",
    "source": "《史记·曹相国世家》：曹参代萧何为汉相国，凡事无所变更，一遵萧何约束。百姓歌曰：“萧何为法，讲若画一；曹参代之，守而勿失。载其清净，民以宁一。”比喻按照前人的成规办事。"
  },
  {
    "content": "The Ant and the Grasshopper (蚂蚁和蚱蜢)",
    "source": "《伊索寓言》：蚂蚁夏天辛勤储粮，蚱蜢只顾唱歌。冬天蚱蜢挨饿求蚂蚁，蚂蚁说：“你夏天唱歌，冬天就跳舞吧。”道理：凡事应预先准备，今日事今日毕。"
  },
  {
    "content": "The Lorax (老雷斯)",
    "source": "苏斯博士故事：万斯勒为赚钱砍光美丽的 Truffula 树林，不顾老雷斯的警告，导致环境破坏，动物逃离。道理：要保护环境，不能为短期利益破坏自然，每个人都有责任守护地球。"
  },
  {
    "content": "盲人摸象",
    "source": "《大般涅槃经》：王令盲人摸象，触其牙者言象形如萝菔根，触其耳者言如箕，触其头者言如石，触其鼻者言如杵，触其脚者言如木臼，触其脊者言如床，触其腹者言如瓮，触其尾者言如绳。各各共诤，互相是非。比喻对事物了解不全而固执一点，乱加揣测。"
  },
  {
    "content": "The Sword of Damocles (达摩克利斯之剑)",
    "source": "古希腊传说：西西里暴君狄奥尼修斯二世用一根马鬃将利剑悬于朝臣达摩克利斯座上空，使其时刻感受危机。比喻时刻存在的危险。"
  },
  {
    "content": "The Owl and the Birds (猫头鹰和鸟)",
    "source": "《伊索寓言》：猫头鹰劝鸟吃槲寄生种子（粘鸟用），鸟不听；后劝吃人插的嫩枝（做捕鸟胶），鸟听，结果被捉。比喻听信不可靠者。"
  },
  {
    "content": "The Elves and the Shoemaker (小精灵和鞋匠)",
    "source": "格林童话：善良贫穷的鞋匠夫妇，发现每晚有小精灵帮他们做精美的鞋子。他们致富后，为精灵做小衣服答谢。道理：善良和感恩会有好报，要帮助他人。"
  },
  {
    "content": "运筹帷幄",
    "source": "《史记·高祖本纪》：刘邦曰：“夫运筹策帷帐之中，决胜于千里之外，吾不如子房（张良）。”指在后方决定作战策略。"
  },
  {
    "content": "Guess How Much I Love You (猜猜我有多爱你)",
    "source": "绘本：小栗色兔子和大栗色兔子用各种方式比赛谁爱对方更多，但父母的爱总是更深更远。道理：父母对孩子的爱是无限大的，爱是无法衡量的。"
  },
  {
    "content": "The Little Mermaid (小美人鱼)",
    "source": "安徒生童话：小美人鱼用声音换双腿，每走一步都如刀割，只为见到王子。但王子娶了别人，她本可杀王子换回生命，却选择化为泡沫。道理：爱是成全与牺牲，真正的爱不是占有。"
  },
  {
    "content": "一箭双雕",
    "source": "《北史·长孙晟传》：长孙晟善射，突厥摄图请其射雕。见二雕争肉，晟一箭贯双雕。比喻做一件事达到两个目的。"
  },
  {
    "content": "逼上梁山",
    "source": "《水浒传》中林冲等众多好汉因受官府迫害，被迫上梁山造反。比喻被迫进行反抗或不得不做某事。"
  },
  {
    "content": "The Ass in the Lion's Skin (披着狮皮的驴)",
    "source": "《伊索寓言》：驴披狮皮吓唬动物，后被狐狸识破（因听到驴叫）。比喻虚张声势被识破。"
  },
  {
    "content": "马革裹尸",
    "source": "《后汉书·马援传》：男儿要当死于边野，以马革裹尸还葬耳，何能卧床上在儿女子手中邪？形容英勇作战，献身疆场。"
  },
  {
    "content": "抱薪救火",
    "source": "《史记·魏世家》：以地事秦，譬犹抱薪救火，薪不尽，火不灭。比喻用错误的方法去消除灾祸，结果使灾祸反而扩大。"
  },
  {
    "content": "塞翁失马",
    "source": "《淮南子·人间训》：边塞老翁的马走失，邻人安慰，翁曰：“怎知非福？”后马带胡人骏马归。邻人祝贺，翁曰：“怎知非祸？”儿子骑骏马摔断腿。邻人安慰，翁曰：“怎知非福？”后胡人入侵，壮丁参战多死，其子因跛免役。比喻祸福相依。"
  },
  {
    "content": "亡羊补牢",
    "source": "《战国策·楚策四》：庄辛劝楚襄王警惕秦国，襄王不听。后秦占郢都，襄王召庄辛问计。庄辛说：“见兔顾犬未为晚，亡羊补牢未为迟。”比喻出错后及时补救。"
  },
  {
    "content": "纸上谈兵",
    "source": "《史记·廉颇蔺相如列传》：赵括自幼熟读兵书，善于谈兵，其父赵奢也难不倒他。但赵奢认为他不能实战。后赵括代廉颇为将，长平之战中只知照搬兵书，导致赵军大败。比喻空谈理论，不能解决实际问题。"
  },
  {
    "content": "The Hare and the Tortoise (兔子和乌龟)",
    "source": "同“The Tortoise and the Hare”。"
  },
  {
    "content": "The Sick Lion (生病的狮子)",
    "source": "《伊索寓言》：狮王生病，动物们探望，狐狸观察发现只有进洞脚印无出洞脚印，识破阴谋。比喻智者从迹象察危险。"
  },
  {
    "content": "The Dog in the Manger (马槽里的狗)",
    "source": "《伊索寓言》：狗占马槽，自己不吃草也不让马吃。比喻占着对自己无用的东西，不让需要的人用。"
  },
  {
    "content": "The Little Red Hen (红色小母鸡)",
    "source": "西方童话：小母鸡想种小麦、磨面粉、做面包，猪、猫、鸭都不愿帮忙。面包烤好后，朋友们想来吃，小母鸡说：“谁干活，谁分享。” 道理：一分耕耘，一分收获，不劳者不食。"
  },
  {
    "content": "闻鸡起舞",
    "source": "《晋书·祖逖传》：祖逖与刘琨同为司州主簿，感情深厚，共被同寝。半夜闻荒鸡鸣，逖蹴琨觉曰：“此非恶声也。”因起舞。比喻志士及时奋发。"
  },
  {
    "content": "The Bell and the Cat (系铃于猫)",
    "source": "《伊索寓言》：老鼠们商议如何对付猫，有年轻鼠提议给猫系铃以便预警。但无鼠敢去系铃。比喻说起来容易做起来难的计划。"
  },
  {
    "content": "井底之蛙",
    "source": "《庄子·秋水》：井蛙对东海之鳖说：“我独占一井之水，跳跃于井栏之上，休息于破砖之间，快乐至极。你何不进来一看？”鳖左足未入，右膝已被绊住。于是退却，向蛙讲述大海之辽阔。井蛙惊骇不已。比喻见识短浅。"
  },
  {
    "content": "铁杵成针",
    "source": "明·郑之珍《目连救母·四·刘氏斋尼》：传说李白少时遇老妪磨铁杵，问何为，答曰：“欲作针。”白感其言，遂奋发读书。比喻持之以恒，终能成功。"
  },
  {
    "content": "邯郸学步",
    "source": "《庄子·秋水》：燕国少年到赵国都城邯郸，见当地人走路姿态优美，便学习模仿，结果不仅没学会，连自己原来的走法也忘了，只好爬回燕国。比喻模仿不成，反失原有本领。"
  },
  {
    "content": "The Two Bags (两个口袋)",
    "source": "《伊索寓言》：人说人挂两口袋，前袋装别人缺点，后袋装自己缺点，所以只见别人缺点不见自己。比喻严于律人，宽于律己。"
  },
  {
    "content": "Achilles' Heel (阿喀琉斯之踵)",
    "source": "希腊神话：英雄阿喀琉斯出生后被母亲提起脚踵浸入冥河斯提克斯，因此全身刀枪不入，唯有未沾到水的脚踵是弱点。在特洛伊战争中，他被帕里斯一箭射中脚踵而丧生。比喻致命的弱点。"
  },
  {
    "content": "请君入瓮",
    "source": "《资治通鉴·唐纪》：武则天命来俊臣审周兴。俊臣问兴：“囚多不承，当为何法？”兴曰：“取大瓮，以炭四周炙之，令囚入中，何事不承！”俊臣乃索大瓮，火围如兴法，因起谓兴曰：“有内状推兄，请兄入此瓮。”兴惶恐叩头伏罪。比喻以其人之道，还治其人之身。"
  },
  {
    "content": "掩耳盗铃",
    "source": "《吕氏春秋·自知》：有人想偷钟，但钟太重背不动，便想砸碎后搬走。砸钟会发声，他怕人听见，就捂住自己耳朵，以为别人也听不到了。比喻自欺欺人。"
  },
  {
    "content": "The Emperor's New Clothes (皇帝的新装)",
    "source": "安徒生童话：皇帝被骗子愚弄，穿上“愚蠢者看不见”的“新衣”裸体游行，一儿童揭穿真相。道理：要保持童心，敢于说真话，虚荣会让人变得愚蠢。"
  },
  {
    "content": "The Goose with the Golden Eggs (下金蛋的鹅)",
    "source": "同“The Goose That Laid the Golden Eggs”。"
  },
  {
    "content": "螳螂捕蝉",
    "source": "《庄子·山木》：庄周游于雕陵之樊，睹一异鹊自南方来者，翼广七尺，目大运寸，感周之颡而集于栗林。庄周曰：“此何鸟哉，翼殷不逝，目大不睹？”蹇裳躩步，执弹而留之。睹一蝉，方得美荫而忘其身；螳螂执翳而搏之，见得而忘其形；异鹊从而利之，见利而忘其真。庄周怵然曰：“噫！物固相累，二类相召也！”捐弹而反走。比喻目光短浅，只顾眼前利益而不顾后患。"
  },
  {
    "content": "The Gingerbread Man (姜饼人)",
    "source": "西方童话：刚烤好的姜饼人逃跑，边跑边唱“跑快点，你抓不到我！” 先后甩开老夫妻、牛、马，最后被狐狸骗过河而吃掉。道理：骄傲使人失败，要警惕甜言蜜语。"
  },
  {
    "content": "黄粱一梦",
    "source": "唐·沈既济《枕中记》：卢生于邯郸客店遇道士吕翁，自叹穷困。翁授之枕，生梦入枕中，享尽富贵荣华。及醒，店主炊黄粱未熟。比喻虚幻不实的事和欲望的破灭。"
  },
  {
    "content": "老马识途",
    "source": "《韩非子·说林上》：管仲、隰朋从桓公伐孤竹，春往冬返，迷惑失道。管仲曰：“老马之智可用也。”乃放老马而随之，遂得道。比喻有经验的人对事情比较熟悉。"
  },
  {
    "content": "一鼓作气",
    "source": "《左传·庄公十年》：曹刿论战，“夫战，勇气也。一鼓作气，再而衰，三而竭。”指做事要趁起初情绪高涨时，一口气完成。"
  },
  {
    "content": "The Fox and the Stork (狐狸和鹳)",
    "source": "《伊索寓言》：狐狸用浅盘请鹳喝汤，鹳喝不到；鹳用长颈瓶回请狐狸，狐狸喝不到。道理：你希望别人怎样待你，你就要怎样待别人。要学会换位思考。"
  },
  {
    "content": "Burning the midnight oil (挑灯夜战)",
    "source": "西方谚语，原指点灯熬夜工作。比喻开夜车勤奋工作或学习。"
  },
  {
    "content": "守株待兔",
    "source": "《韩非子·五蠹》：宋国农夫偶见兔子撞树桩而死，便放下农具守在树旁，希望再得兔子。结果兔子没等到，田地也荒芜了。比喻妄想不劳而获，或死守狭隘经验。"
  },
  {
    "content": "叶公好龙",
    "source": "汉·刘向《新序·杂事》：叶公爱龙，器物上皆刻龙。真龙闻讯来访，叶公见后吓得魂飞魄散。比喻表面爱好，实则惧怕。"
  },
  {
    "content": "The Old Man and Death (老人和死神)",
    "source": "《伊索寓言》：老人背柴累，唤死神，死神现，老人说帮抬柴。比喻人虽抱怨生活，仍留恋生命。"
  },
  {
    "content": "庖丁解牛",
    "source": "《庄子·养生主》：庖丁为文惠君解牛，手法娴熟，刀入牛体骨节空隙，游刃有余。刀用了十九年仍如新磨。比喻技艺纯熟，解决问题得心应手。"
  },
  {
    "content": "The Fox and the Crow (狐狸和乌鸦)",
    "source": "《伊索寓言》：乌鸦叼奶酪站树上。狐狸夸其歌声美，乌鸦开口唱歌，奶酪掉下被狐狸叼走。比喻爱听奉承话易上当。"
  },
  {
    "content": "胸有成竹",
    "source": "宋·苏轼《文与可画筼筜谷偃竹记》：画家文同（字与可）画竹前，心中已有竹子的完整形象。比喻做事前已有完整的计划打算。"
  },
  {
    "content": "The Swallow and the Crow (燕子和乌鸦)",
    "source": "《伊索寓言》：燕子夸羽毛美，乌鸦说我冬天羽毛也美，你冬天飞走。比喻耐久胜于一时美。"
  },
  {
    "content": "三人成虎",
    "source": "《战国策·魏策二》：庞葱与太子质于邯郸，谓魏王曰：“今一人言市有虎，王信之乎？”王曰：“否。”“二人言市有虎，王信之乎？”王曰：“寡人疑之矣。”“三人言市有虎，王信之乎？”王曰：“寡人信之矣。”庞葱曰：“夫市之无虎明矣，然而三人言而成虎。”比喻谣言或讹传一再重复，就能使人信以为真。"
  },
  {
    "content": "The Bald Man and the Fly (秃子和苍蝇)",
    "source": "《伊索寓言》：苍蝇叮秃头，秃子拍打打到自己，苍蝇笑说叮一下何必拼命，秃子说宁可打自己也要报仇。比喻被小麻烦激怒做出过度反应。"
  },
  {
    "content": "风声鹤唳",
    "source": "《晋书·谢玄传》：淝水之战，前秦苻坚军队败退，闻风声鹤唳，皆以为晋兵追至。形容惊慌失措，自相惊扰。"
  },
  {
    "content": "伯乐相马",
    "source": "汉·韩婴《韩诗外传》：使骥不得伯乐，安得千里之足。比喻善于发现、选拔、使用出色人才。"
  },
  {
    "content": "Rumpelstiltskin (名字古怪的小矮人)",
    "source": "格林童话：磨坊主女儿被国王关起来把稻草纺成金，小矮人帮忙但要她未来的孩子。她猜中小矮人的名字，保住了孩子。道理：信守诺言很重要，而智慧可以帮助我们解决难题。"
  },
  {
    "content": "The Father and His Two Daughters (父亲和两个女儿)",
    "source": "《伊索寓言》：父亲嫁女，一给菜农，一给砖瓦匠。访种菜女盼下雨利菜，访砖瓦匠女盼晴天利砖，左右为难。比喻两难处境。"
  },
  {
    "content": "滥竽充数",
    "source": "《韩非子·内储说上》：齐宣王爱听三百人合奏吹竽。南郭先生不会吹，也混在队里。宣王死后，湣王喜听独奏，南郭只好逃走。比喻无真才实学混迹其中。"
  },
  {
    "content": "The Oak and the Reeds (橡树和芦苇)",
    "source": "《伊索寓言》：狂风袭来，坚固的橡树被连根拔起，柔软的芦苇弯腰存活。比喻柔能克刚。"
  },
  {
    "content": "一字之师",
    "source": "宋·计有功《唐诗纪事》：郑谷改僧齐己《早梅》诗“前村深雪里，昨夜数枝开”为“一枝开”，齐己拜服。时人称郑谷为“一字师”。指能改正一个字的老师。"
  },
  {
    "content": "The Trumpeter Taken Prisoner (被俘的号手)",
    "source": "《伊索寓言》：号手被俘求饶，说未杀敌只吹号。敌人说你不作战但鼓动别人作战，更该杀。比喻煽动者比执行者更可恶。"
  },
  {
    "content": "The Shepherd and the Sea (牧羊人和海)",
    "source": "《伊索寓言》：牧羊人见海平静，想航海经商，遇风暴失货物，后见海平静说又想骗他。比喻不能因一时顺利低估风险。"
  },
  {
    "content": "杯弓蛇影",
    "source": "汉·应劭《风俗通义·怪神》：杜宣赴饮，见杯中似有蛇，饮后即觉腹痛，久治不愈。后知是壁上赤弩照于杯，形如蛇，病遂愈。比喻因疑神疑鬼而引起恐惧。"
  },
  {
    "content": "The Bull and the Goat (公牛和山羊)",
    "source": "《伊索寓言》：公牛躲狮子的山洞，山羊顶他，公牛说怕狮子不怕你。比喻在强者前受气，在弱者前逞能。"
  },
  {
    "content": "三顾茅庐",
    "source": "三国蜀·诸葛亮《出师表》：刘备为请诸葛亮出山辅佐，三次到南阳草庐拜访。比喻诚心诚意一再邀请。"
  },
  {
    "content": "The Wolf and the Crane (狼和鹤)",
    "source": "《伊索寓言》：狼骨头卡喉，请鹤用长嘴取出，答应给报酬。取出后狼拒付，说鹤头能安全退出已是报酬。比喻替坏人做事得不到报酬。"
  },
  {
    "content": "The Midas Touch (点石成金)",
    "source": "希腊神话：弗利治亚国王迈达斯求神赐予点物成金的能力。但连食物和女儿也变成金子，只好放弃此能力。比喻有赚大钱的本事，也讽刺贪婪。"
  },
  {
    "content": "The Wasp and the Snake (黄蜂和蛇)",
    "source": "《伊索寓言》：黄蜂坐蛇头蜇多次，蛇怒，但抓不到，遂让货车压同归于尽。比喻被小人物逼急采取极端。"
  },
  {
    "content": "Rome was not built in a day (罗马非一日建成)",
    "source": "西方谚语，最早出现在16世纪英国剧作家约翰·海伍德的作品中。比喻伟大事业非一蹴而就，需要长期努力。"
  },
  {
    "content": "对牛弹琴",
    "source": "汉·牟融《理惑论》：公明仪为牛弹清角之操，伏食如故。非牛不闻，不合其耳矣。比喻对不懂道理的人讲道理，对外行人说内行话。也用来讥笑说话的人不看对象。"
  },
  {
    "content": "自相矛盾",
    "source": "《韩非子·难一》：楚人卖矛和盾，先夸盾坚固，任何矛都刺不破；又夸矛锋利，任何盾都能刺破。旁人问：“以子之矛，陷子之盾，何如？”其人弗能应。比喻言行前后抵触。"
  },
  {
    "content": "刻舟求剑",
    "source": "《吕氏春秋·察今》：楚人渡江，佩剑坠水，他在船边刻记号。船停后，从刻记号处下水寻剑，自然找不到。比喻办事拘泥，不知变通。"
  },
  {
    "content": "Turn a blind eye (睁一只眼闭一只眼)",
    "source": "据说源于英国海军上将纳尔逊，他在一次海战中故意用望远镜遮住瞎眼，无视上级的撤退信号。比喻故意忽视。"
  },
  {
    "content": "The Man and the Satyr (人和萨堤尔)",
    "source": "《伊索寓言》：萨堤尔见人冬天呵手取暖，夏天吹粥降温，认为人嘴能出冷热气，不可信赖。比喻反复无常者不可交。"
  },
  {
    "content": "Oh, the Places You'll Go! (哦，你将去的地方！)",
    "source": "苏斯博士绘本：讲述人生旅程有高峰也有低谷，但只要坚持，就能到达美好的地方。道理：人生充满可能，要勇敢面对挑战，未来掌握在自己手中。"
  },
  {
    "content": "悬梁刺股",
    "source": "“悬梁”出自《太平御览》引《汉书》：孙敬好学，晨夕不休，及至眠睡疲寝，以绳系头，悬屋梁。“刺股”出自《战国策·秦策一》：苏秦读书欲睡，引锥自刺其股，血流至足。形容刻苦学习。"
  },
  {
    "content": "The Ass and the Lapdog (驴和宠物狗)",
    "source": "《伊索寓言》：驴羡慕宠物狗得主人宠爱，也学狗撒娇，被痛打。比喻模仿不合身份之举反受其害。"
  },
  {
    "content": "The Young Man and the Swallow (青年和燕子)",
    "source": "《伊索寓言》：青年见早归燕子以为春天到，卖外套，后遇寒流后悔。比喻根据个别现象决策危险。"
  },
  {
    "content": "精卫填海",
    "source": "《山海经·北山经》：炎帝女女娃游于东海，溺而不返，化为精卫鸟，常衔西山木石，以填东海。比喻意志坚强，不畏艰难。"
  },
  {
    "content": "The Hare with Many Friends (多朋友的兔子)",
    "source": "《伊索寓言》：兔子被猎狗追，向众多朋友（牛、羊、马等）求助，均找借口推脱。最后被猎狗追上。比喻酒肉朋友多，患难知己少。"
  },
  {
    "content": "The Cat and the Mice (猫和老鼠)",
    "source": "《伊索寓言》：猫捉鼠，鼠不敢出，猫扮吊死，鼠识破说爪子是活的。比喻吃一堑长一智。"
  },
  {
    "content": "The Fighting Cocks and the Eagle (斗鸡和鹰)",
    "source": "《伊索寓言》：两斗鸡胜负已分，败者躲起，胜者得意飞上墙炫耀，被鹰抓走。败者反而安全。比喻得意忘形招祸。"
  },
  {
    "content": "The Miller, His Son, and Their Donkey (磨坊主、儿子和驴)",
    "source": "《伊索寓言》：父子牵驴进城，听人议论不该让驴闲走，儿子骑驴被说不孝，父亲骑驴被说残忍，两人同骑被说虐待动物，最后抬驴过桥，驴挣扎落水。比喻没有主见，左右为难。"
  },
  {
    "content": "The Mole and Its Mother (鼹鼠和妈妈)",
    "source": "《伊索寓言》：小鼹鼠说能看见，妈妈拿香粒问，小鼹鼠说是石子。妈妈说你看不见还闻不出。比喻说谎易被揭穿。"
  },
  {
    "content": "The Little Engine That Could (勇敢的小火车头)",
    "source": "美国童话：一列装满玩具的火车需要翻过高山，大火车头都不愿帮忙。小蓝色火车头虽然小，但一边说“我想我能行！我想我能行！”，最终成功。道理：自信和积极的态度是成功的关键。"
  },
  {
    "content": "Corduroy (小熊可杜罗)",
    "source": "绘本：商场玩具熊掉了一颗纽扣，一直没人买它。小女孩喜欢它，用零花钱买下它，为它缝上新纽扣。道理：爱和接纳不完美，真正的价值在于被需要和被爱。"
  },
  {
    "content": "入木三分",
    "source": "唐·张怀瓘《书断·王羲之》：晋帝祭北郊，王羲之书祝版，工人削之，笔入木三分。形容书法笔力刚劲，也比喻见解深刻。"
  },
  {
    "content": "约法三章",
    "source": "《史记·高祖本纪》：刘邦入咸阳，与父老约，法三章耳：杀人者死，伤人及盗抵罪。余悉除去秦法。泛指订立简单的条款。"
  },
  {
    "content": "The Rose and the Amaranth (玫瑰和苋菜)",
    "source": "《伊索寓言》：玫瑰羡慕苋菜长寿，苋菜说玫瑰虽短暂但芬芳被记念。比喻质量胜于数量。"
  },
  {
    "content": "The Lion's Share (狮子的份额)",
    "source": "《伊索寓言》：狮子与其他野兽合作狩猎，分猎物时，狮子以各种借口（如因为是王、因最勇猛、另一份归他妻子、谁动第四份就打架）独占全部。比喻最大或全部份额。"
  },
  {
    "content": "The Walnut-Tree (核桃树)",
    "source": "《伊索寓言》：核桃树被投石打果，叹果实招祸。比喻优点反招麻烦。"
  },
  {
    "content": "Sour Grapes (酸葡萄)",
    "source": "《伊索寓言》：狐狸想吃高挂的葡萄，跳了几次都够不着，只好放弃，并安慰自己说：“葡萄肯定是酸的。”比喻得不到的东西，就贬低它。"
  },
  {
    "content": "The Mule (骡子)",
    "source": "《伊索寓言》：骡子炫耀妈妈是善跑的马，倦时想起爸爸是驴。比喻不能只提光荣历史。"
  },
  {
    "content": "The Astronomer (天文学家)",
    "source": "《伊索寓言》：天文学家观星坠井，路人说他连地上都看不清还想懂天上。比喻不切实际。"
  },
  {
    "content": "The Gnat and the Lion (蚊子和狮子)",
    "source": "《伊索寓言》：蚊子打败狮子，得意忘形撞蜘蛛网。比喻胜强敌后疏忽小危险。"
  },
  {
    "content": "The Wolf in Sheep's Clothing (披着羊皮的狼)",
    "source": "《伊索寓言》：狼披上羊皮混入羊群，伺机吃羊。被牧人识破。道理：坏人会伪装，不能只看外表，要警惕伪装善良的恶人。"
  },
  {
    "content": "司空见惯",
    "source": "唐·孟棨《本事诗·情感》：刘禹锡罢和州刺史，李司空绅慕名邀饮，命歌妓劝酒。刘于席上赋诗：“司空见惯浑闲事，断尽江南刺史肠。”指某事常见，不足为奇。"
  },
  {
    "content": "投笔从戎",
    "source": "《后汉书·班超传》：班超家贫，为官佣书以供养。久劳苦，尝辍业投笔叹曰：“大丈夫无它志略，犹当效傅介子、张骞立功异域，以取封侯，安能久事笔砚间乎？”后立功西域，封定远侯。指文人从军。"
  },
  {
    "content": "The Goose That Laid the Golden Eggs (下金蛋的鹅)",
    "source": "《伊索寓言》：农夫有鹅每日下一金蛋。贪心的农夫以为鹅肚内有金块，杀鹅取之，却什么也没有，再也得不到金蛋。比喻贪图眼前利益，断送长远财源。"
  },
  {
    "content": "The Ass Carrying Salt (驮盐的驴)",
    "source": "《伊索寓言》：驴驮盐过河跌倒，盐溶化变轻；下次驮海绵，故意跌倒，海绵吸水变重压坏。比喻投机取巧反受害。"
  },
  {
    "content": "唇亡齿寒",
    "source": "《左传·僖公五年》：晋献公向虞国借道伐虢国。宫之奇劝谏虞公说：“虢国是虞国的屏障。虢国灭亡，虞国必定跟着完蛋。谚语所谓‘辅车相依，唇亡齿寒’，说的就是虞国和虢国的关系。”虞公不听，晋灭虢后，果然也灭了虞国。比喻利害相关。"
  },
  {
    "content": "Ivory Tower (象牙塔)",
    "source": "19世纪法国批评家圣伯夫用以形容浪漫派诗人维尼脱离现实的创作态度。比喻脱离现实生活的学术世界。"
  },
  {
    "content": "狐假虎威",
    "source": "《战国策·楚策一》：老虎捉到狐狸，狐狸说：“天帝命我为百兽之王，你若吃我，是违抗天命。不信可随我走，看百兽是否怕我。”老虎跟随，百兽果然逃窜。老虎不知百兽是怕自己，反以为怕狐狸。比喻倚仗别人的势力欺压人。"
  },
  {
    "content": "The Fisherman and the Little Fish (渔夫和小鱼)",
    "source": "《伊索寓言》：渔夫捕到小鱼，小鱼求放生说等长大再捕。渔夫说放弃现有小利去追求未定大利是愚蠢。比喻到手的小胜于未到的大。"
  },
  {
    "content": "班门弄斧",
    "source": "唐·柳宗元《王氏伯仲唱和诗序》：操斧于班、郢之门，斯强颜耳。比喻在行家面前卖弄本领。"
  },
  {
    "content": "The Flea and the Man (跳蚤和人)",
    "source": "《伊索寓言》：跳蚤咬人，人捉不到，求神帮忙，结果捏死跳蚤。比喻小事求神反误事。"
  },
  {
    "content": "孟母三迁",
    "source": "汉·刘向《列女传》：孟子幼时家住墓地旁，模仿丧葬哭泣；迁至市集，模仿商人吆喝；最后迁至学宫旁，始习礼仪读书。孟母曰：“真可以处居子矣。”遂居。形容环境对成长的影响。"
  },
  {
    "content": "The Ass and the Mule (驴和骡子)",
    "source": "《伊索寓言》：驴和骡驮货，驴求骡分担，骡不肯，驴累死，主人把驴货全加骡上，骡后悔。比喻应适当帮助他人。"
  },
  {
    "content": "The Very Hungry Caterpillar (好饿的毛毛虫)",
    "source": "艾瑞·卡尔绘本：毛毛虫每天吃很多食物，最后造了个茧，变成美丽的蝴蝶。道理：成长需要营养和耐心，每个人都可以经历蜕变，成为更好的自己。"
  },
  {
    "content": "The Wolf and the Horse (狼和马)",
    "source": "《伊索寓言》：狼见马吃大麦，说愿用尖牙帮马挑出石子，马说若狼不吃草料早信了。比喻恶人伪装被识破。"
  },
  {
    "content": "The Milkmaid and Her Pail (挤奶姑娘和牛奶桶)",
    "source": "《伊索寓言》：姑娘顶牛奶罐盘算卖奶买鸡，鸡生蛋孵小鸡，卖鸡买新衣参加舞会，得意忘形踢翻奶罐，美梦成空。比喻如意算盘落空。"
  },
  {
    "content": "旁若无人",
    "source": "《史记·刺客列传》：荆轲与高渐离饮于燕市，酒酣，渐离击筑，荆轲和而歌于市中，相乐也，已而相泣，旁若无人者。形容态度自然或高傲。"
  },
  {
    "content": "刮目相看",
    "source": "《三国志·吴书·吕蒙传》裴松之注引《江表传》：鲁肃与吕蒙论议，大惊曰：“卿今者才略，非复吴下阿蒙！”蒙曰：“士别三日，即更刮目相待。”指别人已有进步，不能再用老眼光去看他。"
  },
  {
    "content": "The Cock and the Jewel (公鸡和宝石)",
    "source": "《伊索寓言》：公鸡刨出宝石，说对人珍贵，对我不如一粒麦子。比喻东西价值因人而异。"
  },
  {
    "content": "The Woodman and the Serpent (樵夫和蛇)",
    "source": "《伊索寓言》：樵夫救冻僵蛇，蛇醒咬死樵夫。临死樵夫说怜惜恶人该死。比喻恩将仇报。"
  }
]